#  Lifecycle of Data Science Project

### 1. Data Collection

### 2. Exploratory Data Analysis & Feature Engineering

Types of Missing Values:

### 1. Missing completely at random(MCAR):

where the probability of being missing is same for all the observations. 
there is no relation between the values and nan.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
# check for null Vlaues
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [4]:
df.shape

(418, 12)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

### 2. Missing Not at Random : Systematic missing values

there is some relationship between data missing and other values

In [7]:
# now we replace the nan values in Cabin with 1 other wise 0
df['cabin_null']=np.where(df['Cabin'].isnull(),1,0)

# findthe percentage of null values 
df['cabin_null'].mean()

0.7822966507177034

In [8]:
# now check percentage of survived has null values
df.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.823308
1    0.710526
Name: cabin_null, dtype: float64

### 3. Missing at random

here missing values has no proper reason for missing like 
blood sample may got damaged at lab

### all the techniques of handling missing values

1. Mean/median/Mode Replacement
2. Random sample imputation
3. Capturing nan values with new feature
4. end of distribution imputation
5. Arbitrary imputation
6. frequent categories imputation

### mean/median/mode imputaion

when should we apply?
this method has an assumption that data missing is completely at random.

In [9]:
df=pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  34.5   7.8292
1         1  47.0   7.0000
2         0  62.0   9.6875
3         0  27.0   8.6625
4         1  22.0  12.2875

In [10]:
# now check percentage od missing values
df.isnull().mean()

Survived    0.000000
Age         0.205742
Fare        0.002392
dtype: float64

In [11]:
df.isnull().sum()

Survived     0
Age         86
Fare         1
dtype: int64

In [23]:
# now create a function to fill median valuaes in nan
def impute_nan(df,variable,median):
    df[variable+'_median']=df[variable].fillna(median)

In [24]:
# now find median of age
median=df['Age'].median()
median

27.0

In [25]:
mode=df['Age'].mode()
mode

0    21.0
1    24.0
dtype: float64

In [26]:
impute_nan(df,'Age',median)

df.head()

   Survived   Age     Fare  Age_mean  Age_median
0         0  34.5   7.8292      34.5        34.5
1         1  47.0   7.0000      47.0        47.0
2         0  62.0   9.6875      62.0        62.0
3         0  27.0   8.6625      27.0        27.0
4         1  22.0  12.2875      22.0        22.0

In [27]:
df.isnull().mean()

Survived      0.000000
Age           0.205742
Fare          0.002392
Age_mean      0.000000
Age_median    0.000000
dtype: float64

In [28]:
df.drop('Age_mean',axis=1,inplace=True)
df.isnull().mean()

Survived      0.000000
Age           0.205742
Fare          0.002392
Age_median    0.000000
dtype: float64

In [29]:
print(df['Age'].std())
print(df['Age_median'].std())

14.18120923562442
12.703769846333287

### Advantages & Disadvantages of mean/median imputation

### Advantages 
1. it is faster way to get complete data
2. easy to implement

### Disadvantages
1. Change the distortion of curve
2. it impacts correlation